balazsgrill/modembed/pic/core/hu.modembed.pic.ui/device-descriptors/16xxxx/PIC16LF1936.PIC
        <edc:SFRDef edc:access="nnn-nn-n" edc:cname="DACCON0" edc:desc="Voltage Reference Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-00-0" edc:name="DACCON0" edc:nzwidth="8" edc:por="000-00-0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACNSS" edc:desc="DAC1 Negative Source Select bits" edc:mask="0x1" edc:name="DACNSS" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS0" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACPSS1" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x1" edc:name="DACPSS1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="DAC1 Voltage Output Enable bit" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACLPS" edc:desc="DAC 1 Low Power Voltage State Select bit" edc:mask="0x1" edc:name="DACLPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACEN" edc:desc="DAC 1 Enable bit" edc:mask="0x1" edc:name="DACEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="DACPSS" edc:desc="DAC1 Positive Source Select bits" edc:mask="0x3" edc:name="DACPSS" edc:nzwidth="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---nnnnn" edc:cname="DACCON1" edc:desc="Voltage Reference Control Register 2" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="DACCON1" edc:nzwidth="8" edc:por="---00000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DACR0" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR1" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR2" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR3" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="DACR4" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1" edc:name="DACR4" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="DACR" edc:desc="DAC1 Voltage Output Select bits" edc:mask="0x1f" edc:name="DACR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON0" edc:desc="SR Latch Control Register 0" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON0" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRPR" edc:desc="Pulse Reset Input of the SR Latch" edc:mask="0x1" edc:name="SRPR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRPS" edc:desc="Pulse Set Input of the SR Latch" edc:mask="0x1" edc:name="SRPS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRNQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRNQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRQEN" edc:desc="SR Latch Q Output Enable bit" edc:mask="0x1" edc:name="SRQEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK0" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK1" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRCLK2" edc:desc="SR Latch Clock divider bits" edc:mask="0x1" edc:name="SRCLK2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRLEN" edc:desc="SR Latch Enable bit" edc:mask="0x1" edc:name="SRLEN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="SRCLK" edc:desc="SR Latch Clock divider bits" edc:mask="0x7" edc:name="SRCLK" edc:nzwidth="3"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SRCON1" edc:desc="SR Latch Control Register 1" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SRCON1" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SRRC1E" edc:desc="SR Latch C1 Reset Enable bit" edc:mask="0x1" edc:name="SRRC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRC2E" edc:desc="SR Latch C2 Reset Enable bit" edc:mask="0x1" edc:name="SRRC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRCKE" edc:desc="SR Latch Reset Clock Enable bit" edc:mask="0x1" edc:name="SRRCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRRPE" edc:desc="SR Latch Peripheral Reset Enable bit" edc:mask="0x1" edc:name="SRRPE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC1E" edc:desc="SR Latch C1 Set Enable bit" edc:mask="0x1" edc:name="SRSC1E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSC2E" edc:desc="SR Latch C2 Set Enable bit" edc:mask="0x1" edc:name="SRSC2E" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSCKE" edc:desc="SR Latch Set Clock Enable bit" edc:mask="0x1" edc:name="SRSCKE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRSPE" edc:desc="SR Latch Peripheral Set Enable bit" edc:mask="0x1" edc:name="SRSPE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="APFCON" edc:desc="Alternate Pin Function Control Register" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="APFCON" edc:nzwidth="8" edc:por="-0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CCP2SEL" edc:desc="CCP2 Input/Output Pin Selection" edc:mask="0x1" edc:name="CCP2SEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SSSEL" edc:desc="SS Input Pin Selection" edc:mask="0x1" edc:name="SSSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="C2OUTSEL" edc:desc="Comparator 2 Output Pin Selection" edc:mask="0x1" edc:name="C2OUTSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SRNQSEL" edc:desc="SR Latch nQ Output Pin Selection" edc:mask="0x1" edc:name="SRNQSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="P2BSEL" edc:desc="CCP2 PWM B Output Pin Selection" edc:mask="0x1" edc:name="P2BSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSEL" edc:desc="Timer1 Gate Input Pin Selection" edc:mask="0x1" edc:name="T1GSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP3SEL" edc:desc="CCP3 Input/Output Pin Selection" edc:mask="0x1" edc:name="CCP3SEL" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="3" edc:beginaddr="0x180" edc:endaddr="0x1A0" edc:regionid="sfr3">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSELA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSELA" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSA0" edc:desc="" edc:mask="0x1" edc:name="ANSA0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA1" edc:desc="" edc:mask="0x1" edc:name="ANSA1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA2" edc:desc="" edc:mask="0x1" edc:name="ANSA2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA3" edc:desc="" edc:mask="0x1" edc:name="ANSA3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA4" edc:desc="" edc:mask="0x1" edc:name="ANSA4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSA5" edc:desc="" edc:mask="0x1" edc:name="ANSA5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELA" edc:desc="" edc:mask="0x3f" edc:name="ANSELA" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="ANSELB" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111" edc:name="ANSELB" edc:nzwidth="0x8" edc:por="--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ANSB0" edc:desc="" edc:mask="0x1" edc:name="ANSB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB1" edc:desc="" edc:mask="0x1" edc:name="ANSB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB2" edc:desc="" edc:mask="0x1" edc:name="ANSB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB3" edc:desc="" edc:mask="0x1" edc:name="ANSB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB4" edc:desc="" edc:mask="0x1" edc:name="ANSB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ANSB5" edc:desc="" edc:mask="0x1" edc:name="ANSB5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ANSELB" edc:desc="" edc:mask="0x3f" edc:name="ANSELB" edc:nzwidth="6"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
